# SaveToLocalFinished Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentSaveToLocalProgressChangedEventArgs..::..SaveToLocalFinished Property
DocumentSaveToLocalProgressChangedEventArgs Class See Also
---
Indicates if the current "save to local" operation has finished.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public bool SaveToLocalFinished { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SaveToLocalFinished As Boolean
	Get
```

Visual C++
---
```text
public:
property bool SaveToLocalFinished {
	bool get ();
}
```

# See Also
DocumentSaveToLocalProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace